IRP/src/Documents/SalesOrder/SalesOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>SalesOrder</name>
 <registerRecords>AccumulationRegister.R2022B_CustomersPaymentPlanning</registerRecords>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R2010T_SalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R9610T_ShipmentPlaning</registerRecords>
 <registerRecords>AccumulationRegister.R4037B_PlannedReceiptReservationRequests</registerRecords>
 <registerRecords>AccumulationRegister.R2014T_CanceledSalesOrders</registerRecords>
 <registerRecords>InformationRegister.T3010S_RowIDInfo</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.R2011B_SalesOrdersShipment</registerRecords>
 <registerRecords>AccumulationRegister.R3026B_SalesOrdersCustomerAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
 <registerRecords>AccumulationRegister.R3024B_SalesOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.R2012B_SalesOrdersInvoiceClosing</registerRecords>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>DateOfShipment</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Status</name>
  <type>
   <types>CatalogRef.ObjectStatuses</types>
  </type>
 </attributes>
 <attributes>
  <name>UseItemsShipmentScheduling</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.SalesTransactionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>RetailCustomer</name>
  <type>
   <types>CatalogRef.RetailCustomers</types>
  </type>
 </attributes>
 <attributes>
  <name>ShipmentMode</name>
  <type>
   <types>EnumRef.RetailShipmentConfirmationTransactionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ShipFrom</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>ShipFromAddress</name>
  <type>
   <types>CatalogRef.Addresses</types>
  </type>
 </attributes>
 <attributes>
  <name>ShipTo</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>ShipToAddress</name>
  <type>
   <types>CatalogRef.Addresses</types>
  </type>
 </attributes>
 <attributes>
  <name>Carrier</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>VehicleDriver</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Vehicle</name>
  <type>
   <types>CatalogRef.Vehicles</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Cancel</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>OffersAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>PriceType</name>
   <type>
    <types>CatalogRef.PriceTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>DeliveryDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ProcurementMethod</name>
   <type>
    <types>EnumRef.ProcurementMethods</types>
   </type>
  </attributes>
  <attributes>
   <name>Detail</name>
   <type>
    <types>DefinedType.typeDescription</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>DontCalculateRow</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>CancelReason</name>
   <type>
    <types>CatalogRef.CancelReturnReasons</types>
   </type>
  </attributes>
  <attributes>
   <name>PartnerItem</name>
   <type>
    <types>CatalogRef.PartnerItems</types>
   </type>
  </attributes>
  <attributes>
   <name>ReservationDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>SalesPerson</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>IsVariableItemKey</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>IsVariableStore</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecialOffers</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Offer</name>
   <type>
    <types>CatalogRef.SpecialOffers</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Percent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
  <attributes>
   <name>Bonus</name>
   <type>
    <types>DefinedType.typeSpecialOfferBonus</types>
   </type>
  </attributes>
  <attributes>
   <name>AddInfo</name>
   <type>
    <types>DefinedType.typeSpecialOfferAddInfo</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DELETE_TaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>Analytics</name>
   <type>
    <types>CatalogRef.TaxAnalytics</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IncludeToTotalAmount</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ManualAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>PaymentTerms</name>
  <attributes>
   <name>Date</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ProportionOfPayment</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>5</precision>
     <scale>2</scale>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>DuePeriod</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>EnumRef.CalculationTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>CanBePaid</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Payments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentType</name>
   <type>
    <types>CatalogRef.PaymentTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentTerminal</name>
   <type>
    <types>CatalogRef.PaymentTerminals</types>
   </type>
  </attributes>
  <attributes>
   <name>Account</name>
   <type>
    <types>CatalogRef.CashAccounts</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Percent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
  <attributes>
   <name>Commission</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>BankTerm</name>
   <type>
    <types>CatalogRef.BankTerms</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RowIDInfo</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Basis</name>
   <type>
    <types>DocumentRef</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrentStep</name>
   <type>
    <types>CatalogRef.MovementRules</types>
   </type>
  </attributes>
  <attributes>
   <name>NextStep</name>
   <type>
    <types>CatalogRef.MovementRules</types>
   </type>
  </attributes>
  <attributes>
   <name>RowRef</name>
   <type>
    <types>CatalogRef.RowIDs</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R4037B_PlannedReceiptReservationRequests/R4037B_PlannedReceiptReservationRequests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R4037B_PlannedReceiptReservationRequests</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ProcurementMethods/ProcurementMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ProcurementMethods</name>
 <enumValues>
  <name>Stock</name>
 </enumValues>
 <enumValues>
  <name>Purchase</name>
 </enumValues>
 <enumValues>
  <name>NoReserve</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ItemTypes</name>
 <enumValues>
  <name>Service</name>
 </enumValues>
 <enumValues>
  <name>Product</name>
 </enumValues>
 <enumValues>
  <name>Certificate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/CalculationTypes/CalculationTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CalculationTypes</name>
 <enumValues>
  <name>AdvancesUntilHolds</name>
 </enumValues>
 <enumValues>
  <name>Prepaid</name>
 </enumValues>
 <enumValues>
  <name>PostShipmentCredit</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/SalesOrder/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function Print(Ref, Param) Export
	if StrCompare(Param.NameTemplate, "SalesOrderPrint") = 0 Then
		Return SalesOrderPrint(Ref, Param);
	EndIf; 
EndFunction

// Sales order print.
// 
// Parameters:
//  Ref - DocumentRef.SalesOrder
//  Param - See UniversalPrintServer.InitPrintParam
// 
// Returns:
//  SpreadsheetDocument - Sales order print
Function SalesOrderPrint(Ref, Param)
		
	Template = GetTemplate("SalesOrderPrint");
	Template.LanguageCode = Param.LayoutLang;
	Query = New Query;
	Text =
		"SELECT
		|	SalesOrder.Number AS Number,
		|	SalesOrder.Date AS Date,
		|	SalesOrder.Company.Description_en AS Company,
		|	SalesOrder.Partner.Description_en AS Partner,
		|	SalesOrder.Author AS Author,
		|	SalesOrder.Ref AS Ref,
		|	SalesOrder.Currency.Description_en AS Currency
		|FROM
		|	Document.SalesOrder AS SalesOrder
		|WHERE
		|	SalesOrder.Ref = &Ref
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	SalesOrderItemList.ItemKey.Item.Description_en AS Item,
		|	SalesOrderItemList.ItemKey.Description_en AS ItemKey,
		|	SalesOrderItemList.Quantity AS Quantity,
		|	SalesOrderItemList.Unit.Description_en AS Unit,
		|	SalesOrderItemList.Price AS Price,
		|	SalesOrderItemList.TaxAmount AS TaxAmount,
		|	SalesOrderItemList.TotalAmount AS TotalAmount,
		|	SalesOrderItemList.NetAmount AS NetAmount,	
		|	SalesOrderItemList.OffersAmount AS OffersAmount,
		|	SalesOrderItemList.Ref AS Ref,
		|	SalesOrderItemList.Key AS Key
		|FROM
		|	Document.SalesOrder.ItemList AS SalesOrderItemList
		|WHERE
		|	SalesOrderItemList.Ref = &Ref
		|	AND NOT SalesOrderItemList.Cancel
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	SalesOrderTaxList.Ref AS Ref,
		|	SalesOrderTaxList.Tax AS Tax,
		|	MIN(SalesOrderTaxList.LineNumber) AS LineNumber
		|FROM
		|	Document.SalesOrder.TaxList AS SalesOrderTaxList
		|WHERE
		|	SalesOrderTaxList.Ref = &Ref
		|	AND SalesOrderTaxList.Key IN
		|		(SELECT
		|
		|			SalesOrderItemList.Key AS Key
		|		FROM
		|			Document.SalesOrder.ItemList AS SalesOrderItemList
		|		WHERE
		|			SalesOrderItemList.Ref = &Ref
		|			AND NOT SalesOrderItemList.Cancel)
		|GROUP BY
		|	SalesOrderTaxList.Ref,
		|	SalesOrderTaxList.Tax
		|
		|ORDER BY
		|	LineNumber
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	SalesOrderTaxList.Ref AS Ref,
		|	SalesOrderTaxList.LineNumber AS LineNumber,
		|	SalesOrderTaxList.Key AS Key,
		|	SalesOrderTaxList.Tax AS Tax,
		|	SalesOrderTaxList.TaxRate AS TaxRate
		|FROM
		|	Document.SalesOrder.TaxList AS SalesOrderTaxList
		|WHERE
		|	SalesOrderTaxList.Ref = &Ref";

	LCode = Param.DataLang;	
	Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrder.Company",LCode);
	Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrder.Partner",LCode);
	Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrder.Currency",LCode);
	Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrderItemList.ItemKey.Item",LCode);
	Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrderItemList.ItemKey",LCode);
	Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrderItemList.Unit",LCode);
	//Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Text,"SalesOrderTaxList.Tax",LCode);
	Query.Text = Text;
		
	Query.Parameters.Insert("Ref", Ref);
	Selection			= Query.ExecuteBatch();
	SelectionHeader		= Selection[0].Select(); 
	SelectionItems		= Selection[1].Unload();
	SelectionItems.Indexes.Add("Ref");
	SelectionHeaderTAX	= Selection[2].Unload();
	SelectionPercentTAX	= Selection[3].Unload();

	AreaCaption			= Template.GetArea("Caption");
	AreaHeader			= Template.GetArea("Header");
	AreaItemListHeader	= Template.GetArea("ItemListHeader|ItemColumn");
	AreaItemList		= Template.GetArea("ItemList|ItemColumn");
	AreaFooter			= Template.GetArea("Footer");
	AreaListHeaderTAX	= Template.GetArea("ItemListHeaderTAX|ColumnTAX");
	AreaListTAX			= Template.GetArea("ItemListTAX|ColumnTAX");

	Spreadsheet = New SpreadsheetDocument;
	Spreadsheet.LanguageCode = Param.LayoutLang;
		
	While SelectionHeader.Next() Do
        AreaCaption.Parameters.Fill(SelectionHeader);
		Spreadsheet.Put(AreaCaption);

		AreaHeader.Parameters.Fill(SelectionHeader);
		Spreadsheet.Put(AreaHeader);
		
		Spreadsheet.Put(AreaItemListHeader);
		For It = 0 To SelectionHeaderTAX.Count() - 1 Do
			AreaListHeaderTAX.Parameters.NameTAX = LocalizationEvents.DescriptionRefLocalization(SelectionHeaderTAX[It].Tax, Spreadsheet.LanguageCode);
			Spreadsheet.Join(AreaListHeaderTAX);
		EndDo;
		
		Choice	= New Structure("Ref", SelectionHeader.Ref);
		FindRow = SelectionItems.FindRows(Choice);
		
		Number		= 0;
		TotalSum	= 0;
		TotalTax	= 0;
		TotalNet	= 0;
		TotalOffers	= 0;
		For Each It In FindRow Do
			Number = Number + 1;
			AreaItemList.Parameters.Fill(It);	
			AreaItemList.Parameters.Number = Number;
			Spreadsheet.Put(AreaItemList);
			
			For ItTax = 0 To SelectionHeaderTAX.Count() - 1 Do
				Tax = SelectionHeaderTAX[ItTax].Tax;
				ChoiceTax	= New Structure("Ref, Key, Tax", SelectionHeader.Ref, It.Key, Tax);
				FindRowTax		= SelectionPercentTAX.FindRows(ChoiceTax);
				For Each ItPercent In FindRowTax Do
					AreaListTAX.Parameters.PercentTax = ItPercent.TaxRate;
					Spreadsheet.Join(AreaListTAX);
				EndDo;
			EndDo;
			TotalSum	= TotalSum + It.TotalAmount;
			TotalTax	= TotalTax + It.TaxAmount;
			TotalOffers	= TotalOffers + It.OffersAmount;
			TotalNet	= TotalNet + It.NetAmount
		EndDo;
	EndDo;
	
	AreaFooter.Parameters.Number		= Number;
	AreaFooter.Parameters.Total			= TotalSum;
	AreaFooter.Parameters.Currency		= SelectionHeader.Currency;
	AreaFooter.Parameters.Total			= TotalSum;
	AreaFooter.Parameters.TotalTax		= TotalTax;
	AreaFooter.Parameters.TotalNet		= TotalNet;
	AreaFooter.Parameters.TotalOffers	= TotalOffers;
	AreaFooter.Parameters.Manager		= SelectionHeader.Author;
	Spreadsheet.Put(AreaFooter);
	
	Return Spreadsheet;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure();

	ObjectStatusesServer.WriteStatusToRegister(Ref, Ref.Status);
	StatusInfo = ObjectStatusesServer.GetLastStatusInfo(Ref);
	Parameters.Insert("StatusInfo", StatusInfo);
	If Not StatusInfo.Posting Then
#Region NewRegistersPosting
		QueryArray = GetQueryTextsSecondaryTables();
		Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
		PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
#EndRegion
		Return Tables;
	EndIf;

	Parameters.IsReposting = False;

#Region NewRegistersPosting
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
#EndRegion
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
#Region NewRegisterPosting
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
#EndRegion
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();

#Region NewRegistersPosting
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
#EndRegion

	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
#Region NewRegistersPosting
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
#EndRegion
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	StatusInfo = ObjectStatusesServer.GetLastStatusInfo(Ref);
	Unposting = ?(Parameters.Property("Unposting"), Parameters.Unposting, False);
	AccReg = AccumulationRegisters;
	LineNumberAndItemKeyFromItemList = PostingServer.GetLineNumberAndItemKeyFromItemList(Ref,
		"Document.SalesOrder.ItemList");

	If StatusInfo.Posting Then
		CommonFunctionsClientServer.PutToAddInfo(AddInfo, "BalancePeriod",
			New Boundary(New PointInTime(StatusInfo.Period, Ref), BoundaryType.Including));
	EndIf;
	
	CheckAfterWrite_R4010B_R4011B(Ref, Cancel, Parameters, AddInfo);

	If Not Cancel And Not AccReg.R4037B_PlannedReceiptReservationRequests.CheckBalance(Ref,
		LineNumberAndItemKeyFromItemList, PostingServer.GetQueryTableByName("R4037B_PlannedReceiptReservationRequests",
		Parameters), PostingServer.GetQueryTableByName("R4037B_PlannedReceiptReservationRequests_Exists", Parameters),
		AccumulationRecordType.Receipt, Unposting, AddInfo) Then
		Cancel = True;
	EndIf;
EndProcedure

Procedure CheckAfterWrite_R4010B_R4011B(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("RecordType", AccumulationRecordType.Expense);
	PostingServer.CheckBalance_AfterWrite(Ref, Cancel, Parameters, "Document.SalesOrder.ItemList", AddInfo);
EndProcedure

#EndRegion

#Region NewRegistersPosting

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure();
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StatusInfo = ObjectStatusesServer.GetLastStatusInfo(Ref);
	StrParams.Insert("StatusInfoPosting", StatusInfo.Posting);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array();
	QueryArray.Add(ItemList());
	QueryArray.Add(PostingServer.Exists_R4011B_FreeStocks());
	QueryArray.Add(R4037B_PlannedReceiptReservationRequests_Exists());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array();
	QueryArray.Add(R2010T_SalesOrders());
	QueryArray.Add(R2011B_SalesOrdersShipment());
	QueryArray.Add(R2012B_SalesOrdersInvoiceClosing());
	QueryArray.Add(R2013T_SalesOrdersProcurement());
	QueryArray.Add(R2014T_CanceledSalesOrders());
	QueryArray.Add(R4011B_FreeStocks());
	QueryArray.Add(R4012B_StockReservation());
	QueryArray.Add(R4034B_GoodsShipmentSchedule());
	QueryArray.Add(R2022B_CustomersPaymentPlanning());
	QueryArray.Add(R4037B_PlannedReceiptReservationRequests());
	QueryArray.Add(T3010S_RowIDInfo());
	QueryArray.Add(R3024B_SalesOrdersToBePaid());
	Return QueryArray;
EndFunction

Function ItemList()
	Return "SELECT
	|	SalesOrderItemList.Ref.Company AS Company,
	|	SalesOrderItemList.Store AS Store,
	|	SalesOrderItemList.Store.UseShipmentConfirmation AS UseShipmentConfirmation,
	|	SalesOrderItemList.ItemKey AS ItemKey,
	|	SalesOrderItemList.Ref AS Order,
	|	SalesOrderItemList.Quantity AS UnitQuantity,
	|	SalesOrderItemList.QuantityInBaseUnit AS Quantity,
	|	SalesOrderItemList.Unit,
	|	SalesOrderItemList.ItemKey.Item AS Item,
	|	SalesOrderItemList.Ref.Date AS Period,
	|	SalesOrderItemList.Key AS RowKey,
	|	SalesOrderItemList.DeliveryDate AS DeliveryDate,
	|	SalesOrderItemList.ProcurementMethod,
	|	SalesOrderItemList.ProcurementMethod = VALUE(Enum.ProcurementMethods.Stock) AS IsProcurementMethod_Stock,
	|	SalesOrderItemList.ProcurementMethod = VALUE(Enum.ProcurementMethods.Purchase) AS IsProcurementMethod_Purchase,
	|	SalesOrderItemList.ProcurementMethod = VALUE(Enum.ProcurementMethods.IncomingReserve) AS
	|		IsProcurementMethod_IncomingReserve,
	|	SalesOrderItemList.ProcurementMethod = VALUE(Enum.ProcurementMethods.NoReserve)
	|	OR SalesOrderItemList.ProcurementMethod = VALUE(Enum.ProcurementMethods.IncomingReserve) AS
	|		IsProcurementMethod_NonReserve,
	|	SalesOrderItemList.ItemKey.Item.ItemType.Type = VALUE(Enum.ItemTypes.Service) AS IsService,
	|	SalesOrderItemList.TotalAmount AS Amount,
	|	SalesOrderItemList.Ref.Currency AS Currency,
	|	SalesOrderItemList.Cancel AS IsCanceled,
	|	SalesOrderItemList.CancelReason,
	|	SalesOrderItemList.NetAmount,
	|	SalesOrderItemList.Ref.UseItemsShipmentScheduling AS UseItemsShipmentScheduling,
	|	SalesOrderItemList.OffersAmount,
	|	&StatusInfoPosting AS StatusInfoPosting,
	|	SalesOrderItemList.Ref.Branch AS Branch,
	|	CASE
	|		WHEN SalesOrderItemList.ReservationDate = DATETIME(1, 1, 1)
	|			THEN SalesOrderItemList.Ref.Date
	|		ELSE SalesOrderItemList.ReservationDate
	|	END AS ReservationDate,
	|	SalesOrderItemList.SalesPerson
	|INTO ItemList
	|FROM
	|	Document.SalesOrder.ItemList AS SalesOrderItemList
	|WHERE
	|	SalesOrderItemList.Ref = &Ref
	|	AND &StatusInfoPosting";
EndFunction

Function R2010T_SalesOrders()
	Return "SELECT
		   |	*
		   |INTO R2010T_SalesOrders
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled";
EndFunction

Function R2011B_SalesOrdersShipment()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	*
		   |INTO R2011B_SalesOrdersShipment
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled
		   |	AND NOT ItemList.IsService";
EndFunction

Function R2012B_SalesOrdersInvoiceClosing()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	*
		   |INTO R2012B_SalesOrdersInvoiceClosing
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled";
EndFunction

Function R2013T_SalesOrdersProcurement()
	Return "SELECT
		   |	ItemList.Quantity AS OrderedQuantity,
		   |	*
		   |INTO R2013T_SalesOrdersProcurement
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled
		   |	AND NOT ItemList.IsService
		   |	AND ItemList.IsProcurementMethod_Purchase";
EndFunction

Function R2014T_CanceledSalesOrders()
	Return "SELECT
		   |	*
		   |INTO R2014T_CanceledSalesOrders
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	ItemList.isCanceled";
EndFunction

#Region Stock

Function R4011B_FreeStocks()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Expense) AS RecordType,
		   |	*
		   |INTO R4011B_FreeStocks
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled
		   |	AND NOT ItemList.IsService
		   |	AND ItemList.IsProcurementMethod_Stock";
EndFunction

Function R4012B_StockReservation()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	ItemList.ReservationDate AS Period,
		   |	*
		   |INTO R4012B_StockReservation
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled
		   |	AND NOT ItemList.IsService
		   |	AND ItemList.IsProcurementMethod_Stock";
EndFunction

#EndRegion

Function R4034B_GoodsShipmentSchedule()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	ItemList.DeliveryDate AS Period,
		   |	ItemList.Order AS Basis,
		   |	*
		   |INTO R4034B_GoodsShipmentSchedule
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.isCanceled
		   |	AND NOT ItemList.IsService
		   |	AND NOT ItemList.DeliveryDate = DATETIME(1, 1, 1)
		   |	AND ItemList.UseItemsShipmentScheduling";
EndFunction

Function R2022B_CustomersPaymentPlanning()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	SalesOrderPaymentTerms.Ref.Date AS Period,
		   |	SalesOrderPaymentTerms.Ref.Company AS Company,
		   |	SalesOrderPaymentTerms.Ref.Branch AS Branch,
		   |	SalesOrderPaymentTerms.Ref AS Basis,
		   |	SalesOrderPaymentTerms.Ref.LegalName AS LegalName,
		   |	SalesOrderPaymentTerms.Ref.Partner AS Partner,
		   |	SalesOrderPaymentTerms.Ref.Agreement AS Agreement,
		   |	SUM(SalesOrderPaymentTerms.Amount) AS Amount
		   |INTO R2022B_CustomersPaymentPlanning
		   |FROM
		   |	Document.SalesOrder.PaymentTerms AS SalesOrderPaymentTerms
		   |WHERE
		   |	SalesOrderPaymentTerms.Ref = &Ref
		   |	AND SalesOrderPaymentTerms.CalculationType = VALUE(Enum.CalculationTypes.Prepaid)
		   |	AND &StatusInfoPosting
		   |GROUP BY
		   |	SalesOrderPaymentTerms.Ref.Date,
		   |	SalesOrderPaymentTerms.Ref.Company,
		   |	SalesOrderPaymentTerms.Ref.Branch,
		   |	SalesOrderPaymentTerms.Ref.Branch,
		   |	SalesOrderPaymentTerms.Ref,
		   |	SalesOrderPaymentTerms.Ref.LegalName,
		   |	SalesOrderPaymentTerms.Ref.Partner,
		   |	SalesOrderPaymentTerms.Ref.Agreement,
		   |	VALUE(AccumulationRecordType.Receipt)";
EndFunction

Function R4037B_PlannedReceiptReservationRequests()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType, 
		   |	*
		   |	INTO R4037B_PlannedReceiptReservationRequests
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	ItemList.IsProcurementMethod_IncomingReserve";
EndFunction

Function R4037B_PlannedReceiptReservationRequests_Exists()
	Return "SELECT *
		   |	INTO R4037B_PlannedReceiptReservationRequests_Exists
		   |FROM
		   |	AccumulationRegister.R4037B_PlannedReceiptReservationRequests AS R4037B_PlannedReceiptReservationRequests
		   |WHERE
		   |	R4037B_PlannedReceiptReservationRequests.Recorder = &Ref";
EndFunction

Function T3010S_RowIDInfo()
	Return
		"SELECT
		|	RowIDInfo.RowRef AS RowRef,
		|	RowIDInfo.BasisKey AS BasisKey,
		|	RowIDInfo.RowID AS RowID,
		|	RowIDInfo.Basis AS Basis,
		|	ItemList.Key AS Key,
		|	ItemList.Price AS Price,
		|	ItemList.Ref.Currency AS Currency,
		|	ItemList.Unit AS Unit
		|INTO T3010S_RowIDInfo
		|FROM
		|	Document.SalesOrder.ItemList AS ItemList
		|		INNER JOIN Document.SalesOrder.RowIDInfo AS RowIDInfo
		|		ON RowIDInfo.Ref = &Ref
		|		AND ItemList.Ref = &Ref
		|		AND RowIDInfo.Key = ItemList.Key
		|		AND RowIDInfo.Ref = ItemList.Ref";
EndFunction

Function R3024B_SalesOrdersToBePaid()
	Return 
	"SELECT
	|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
	|	PaymentTerms.Ref.Date AS Period,
	|	PaymentTerms.Ref.Company,
	|	PaymentTerms.Ref.Branch,
	|	PaymentTerms.Ref.Currency,
	|	PaymentTerms.Ref.Partner,
	|	PaymentTerms.Ref.LegalName,
	|	PaymentTerms.Ref AS Order,
	|	SUM(PaymentTerms.Amount) AS Amount
	|INTO R3024B_SalesOrdersToBePaid
	|FROM
	|	Document.SalesOrder.PaymentTerms AS PaymentTerms
	|WHERE
	|	PaymentTerms.Ref = &Ref
	|	AND (PaymentTerms.CalculationType = VALUE(Enum.CalculationTypes.Prepaid)
	|	AND PaymentTerms.CanBePaid)
	|	AND &StatusInfoPosting
	|GROUP BY
	|	PaymentTerms.Ref,
	|	PaymentTerms.Ref.Branch,
	|	PaymentTerms.Ref.Company,
	|	PaymentTerms.Ref.Currency,
	|	PaymentTerms.Ref.Date,
	|	PaymentTerms.Ref.LegalName,
	|	PaymentTerms.Ref.Partner,
	|	VALUE(AccumulationRecordType.Receipt)";
EndFunction

#EndRegion
